# 재무제표 읽어서 지표 계산하기
""" 
1. 자기자본비율 = ( 자기자본 / 총자산 ) x 100  금융
2. 무수익 여신비율 = 고정이하여신/총여신 금융
3. 자금여력비율 = 지급여력금액/지급여력기준금액×100 금융
4. 영업용순자본비율 =  ( 자기자본 - 고정자산(영업용순자본) / 총위험액(시장위험액+기초위험액)) * 100
5. 영업이익률 = (영업이익 / 매출액) * 100
6. 총자산이익률(ROA) = (순이익/자산총액) * 100 
7. 판관비율 = 판매 관리비  // 판매원가 = 제조원가 + 판관비 //제조원가 = 직접재료비 + 직접노무비 + 제조간접비 = 원재료 + 노무비 + 제조경비
8. 사업비율 = ??
9. 부채비율 = [(유동부채 + 비유동부채)/자기자본] * 100%
10. 당좌비율 = 당좌자산 / 유동부채 * 100 //당좌자산 = 유동자산 - 재고자산
11. 유동비율 = 유동자산 / 유동부채 * 100
12. 유동성비율 = 당좌비율, 유동비율
13. 순이자보상비율 = 영업이익/(이자비용-이자수익)
14. 자기자본이익률(ROE) =  당기순이익 / 자본총액 //성장성
15. 총자산회전율 = 매출액 / 총자산
16. 영업현금흐름비율 = ??
17. 유형자산회전율 = 매출액 / 유형자산
18. 재고자산회전율 = 매출액 / 재고자산

PBR = 현재주가 / 주당순자산 (BPS) // 자본 대비 고평가
PER = 현재주가 / 주당순이익 (EPS) // 주가 대비 수익성
PCR = 주가/주당현금흐름(CPS)
CPS = cashflow / shares

계정 과목이 달라짐..
최근 3년간 계정과목은 동일 => 3년 간 
"""

class Indicators:
    """
    get indicator
    """
    def __init__(self):
        
        

